betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_adc_ex.c
    /* Process unlocked */
    /* Unlock before starting ADC conversions: in case of potential           */
    /* interruption, to let the process to ADC IRQ Handler.                   */
    __DAL_UNLOCK(hadc);

    /* Set the DMA transfer complete callback */
    hadc->DMA_Handle->XferCpltCallback = ADC_MultiModeDMAConvCplt;

    /* Set the DMA half transfer complete callback */
    hadc->DMA_Handle->XferHalfCpltCallback = ADC_MultiModeDMAHalfConvCplt;

    /* Set the DMA error callback */
    hadc->DMA_Handle->XferErrorCallback = ADC_MultiModeDMAError ;

    /* Manage ADC and DMA start: ADC overrun interruption, DMA start, ADC     */
    /* start (in case of SW start):                                           */

    /* Clear regular group conversion flag and overrun flag */
    /* (To ensure of no unknown state from potential previous ADC operations) */
    __DAL_ADC_CLEAR_FLAG(hadc, ADC_FLAG_EOC);

#if defined(APM32F403xx) || defined(APM32F402xx)
    /* Enable ADC DMA mode */
    hadc->Instance->CTRL2 |= ADC_CTRL2_DMAEN;

    /* Start the DMA channel */
    DAL_DMA_Start_IT(hadc->DMA_Handle, (uint32_t)&hadc->Instance->REGDATA, (uint32_t)pData, Length);

    /* Start conversion of regular group if software start has been selected. */
    /* If external trigger has been selected, conversion will start at next   */
    /* trigger event.                                                         */
    /* Note: Alternate trigger for single conversion could be to force an     */
    /*       additional set of bit ADON "hadc->Instance->CR2 |= ADC_CR2_ADON;"*/
    if (ADC_IS_SOFTWARE_START_REGULAR(hadc))
    {
      /* Start ADC conversion on regular group with SW start */
      SET_BIT(hadc->Instance->CTRL2, (ADC_CTRL2_REGSWSC | ADC_CTRL2_REGEXTTRGEN));
    }
    else
    {
      /* Start ADC conversion on regular group with external trigger */
      SET_BIT(hadc->Instance->CTRL2, ADC_CTRL2_REGEXTTRGEN);
    }
#else
    /* Enable ADC overrun interrupt */
    __DAL_ADC_ENABLE_IT(hadc, ADC_IT_OVR);

    /* Pointer to the common control register to which is belonging hadc    */
    /* (Depending on APM32F4 product, there may be up to 3 ADC and 1 common */
    /* control register)                                                    */
    tmpADC_Common = ADC_COMMON_REGISTER(hadc);

    if (hadc->Init.DMAContinuousRequests != DISABLE)
    {
      /* Enable the selected ADC DMA request after last transfer */
      tmpADC_Common->CCTRL |= ADC_CCTRL_DMAMODEDISSEL;
    }
    else
    {
      /* Disable the selected ADC EOC rising on each regular channel conversion */
      tmpADC_Common->CCTRL &= ~ADC_CCTRL_DMAMODEDISSEL;
    }

    /* Enable the DMA Stream */
    DAL_DMA_Start_IT(hadc->DMA_Handle, (uint32_t)&tmpADC_Common->CDATA, (uint32_t)pData, Length);

    /* if no external trigger present enable software conversion of regular channels */
    if((hadc->Instance->CTRL2 & ADC_CTRL2_REGEXTTRGEN) == RESET)
    {
      /* Enable the selected ADC software conversion for regular group */
      hadc->Instance->CTRL2 |= (uint32_t)ADC_CTRL2_REGSWSC;
    }
#endif /* APM32F403xx || APM32F402xx */
  }
  else
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, DAL_ADC_STATE_ERROR_INTERNAL);

    /* Set ADC error code to ADC IP internal error */
    SET_BIT(hadc->ErrorCode, DAL_ADC_ERROR_INTERNAL);
  }

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Disables ADC DMA (multi-ADC mode) and disables ADC peripheral
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ADCEx_MultiModeStop_DMA(ADC_HandleTypeDef* hadc)
{
  DAL_StatusTypeDef tmp_dal_status = DAL_OK;
  ADC_Common_TypeDef *tmpADC_Common;

  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __DAL_LOCK(hadc);

  /* Stop potential conversion on going, on regular and injected groups */
  /* Disable ADC peripheral */
  __DAL_ADC_DISABLE(hadc);

  /* Pointer to the common control register to which is belonging hadc    */
  /* (Depending on APM32F4 product, there may be up to 3 ADC and 1 common */
  /* control register)                                                    */
  tmpADC_Common = ADC_COMMON_REGISTER(hadc);

  /* Check if ADC is effectively disabled */
  if(DAL_IS_BIT_CLR(hadc->Instance->CTRL2, ADC_CTRL2_ADCEN))
  {
#if defined(APM32F403xx) || defined(APM32F402xx)
    /* Disable ADC DMA mode */
    CLEAR_BIT(tmpADC_Common->CTRL2, ADC_CTRL2_DMAEN);

    /* Reset configuration of ADC DMA continuous request for dual mode */
    CLEAR_BIT(tmpADC_Common->CTRL1, ADC_CTRL1_DUALMCFG);
#else
    /* Disable the selected ADC DMA mode for multimode */
    tmpADC_Common->CCTRL &= ~ADC_CCTRL_DMAMODEDISSEL;
#endif /* APM32F403xx || APM32F402xx */

    /* Disable the DMA channel (in case of DMA in circular mode or stop while */
    /* DMA transfer is on going)                                              */
    tmp_dal_status = DAL_DMA_Abort(hadc->DMA_Handle);

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
    /* Disable ADC overrun interrupt */
    __DAL_ADC_DISABLE_IT(hadc, ADC_IT_OVR);
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

    /* Set ADC state */
    ADC_STATE_CLR_SET(hadc->State,
                      DAL_ADC_STATE_REG_BUSY | DAL_ADC_STATE_INJ_BUSY,
                      DAL_ADC_STATE_READY);
  }

  /* Process unlocked */
  __DAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_dal_status;
}

/**
  * @brief  Returns the last ADC1, ADC2 and ADC3 regular conversions results
  *         data in the selected multi mode.
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @retval The converted data value.
  */
uint32_t DAL_ADCEx_MultiModeGetValue(ADC_HandleTypeDef* hadc)
{
#if defined(APM32F403xx) || defined(APM32F402xx)
  uint32_t tmpDR = 0U;
#else
  ADC_Common_TypeDef *tmpADC_Common;
#endif /* APM32F403xx || APM32F402xx */

  UNUSED(hadc);

#if defined(APM32F403xx) || defined(APM32F402xx)
  /* Note: EOC flag is not cleared here by software because automatically     */
  /*       cleared by hardware when reading register DR.                      */

  /* On STM32F1 devices, ADC1 data register DR contains ADC2 conversions      */
  /* only if ADC1 DMA mode is enabled.                                        */
  tmpDR = hadc->Instance->REGDATA;

  if (DAL_IS_BIT_CLR(ADC1->CTRL2, ADC_CTRL2_DMAEN))
  {
    tmpDR |= (ADC2->REGDATA << 16U);
  }

