betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_adc_ex.c
  /* Return ADC converted value */
  return tmpDR;
#else
  /* Pointer to the common control register to which is belonging hadc    */
  /* (Depending on APM32F4 product, there may be up to 3 ADC and 1 common */
  /* control register)                                                    */
  tmpADC_Common = ADC_COMMON_REGISTER(hadc);

  /* Return the multi mode conversion value */
  return tmpADC_Common->CDATA;
#endif /* APM32F403xx || APM32F402xx */
}
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @brief  Injected conversion complete callback in non blocking mode
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @retval None
  */
__weak void DAL_ADCEx_InjectedConvCpltCallback(ADC_HandleTypeDef* hadc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hadc);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_ADC_InjectedConvCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Configures for the selected ADC injected channel its corresponding
  *         rank in the sequencer and its sample time.
  * @param  hadc pointer to a ADC_HandleTypeDef structure that contains
  *         the configuration information for the specified ADC.
  * @param  sConfigInjected ADC configuration structure for injected channel.
  * @retval None
  */
DAL_StatusTypeDef DAL_ADCEx_InjectedConfigChannel(ADC_HandleTypeDef* hadc, ADC_InjectionConfTypeDef* sConfigInjected)
{
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#ifdef USE_FULL_ASSERT
  uint32_t tmp = 0U;

#endif /* USE_FULL_ASSERT  */
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F403xx) || defined(APM32F402xx)
  __IO uint32_t counter = 0U;
#else
  ADC_Common_TypeDef *tmpADC_Common;
#endif /* APM32F403xx || APM32F402xx */

  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_CHANNEL(sConfigInjected->InjectedChannel));
  ASSERT_PARAM(IS_ADC_INJECTED_RANK(sConfigInjected->InjectedRank));
  ASSERT_PARAM(IS_ADC_SAMPLE_TIME(sConfigInjected->InjectedSamplingTime));
  ASSERT_PARAM(IS_ADC_EXT_INJEC_TRIG(sConfigInjected->ExternalTrigInjecConv));
  ASSERT_PARAM(IS_ADC_INJECTED_LENGTH(sConfigInjected->InjectedNbrOfConversion));
  ASSERT_PARAM(IS_FUNCTIONAL_STATE(sConfigInjected->AutoInjectedConv));
  ASSERT_PARAM(IS_FUNCTIONAL_STATE(sConfigInjected->InjectedDiscontinuousConvMode));

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#ifdef USE_FULL_ASSERT
  tmp = ADC_GET_RESOLUTION(hadc);
  ASSERT_PARAM(IS_ADC_RANGE(tmp, sConfigInjected->InjectedOffset));
#endif /* USE_FULL_ASSERT  */
#else
  ASSERT_PARAM(IS_ADC_RANGE(sConfigInjected->InjectedOffset));
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  if(sConfigInjected->ExternalTrigInjecConv != ADC_INJECTED_SOFTWARE_START)
  {
    ASSERT_PARAM(IS_ADC_EXT_INJEC_TRIG_EDGE(sConfigInjected->ExternalTrigInjecConvEdge));
  }
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Process locked */
  __DAL_LOCK(hadc);

  /* if ADC_Channel_10 ... ADC_Channel_18 is selected */
  if (sConfigInjected->InjectedChannel > ADC_CHANNEL_9)
  {
    /* Clear the old sample time */
    hadc->Instance->SMPTIM1 &= ~ADC_SMPTIM1(ADC_SMPTIM1_SMPCYCCFG10, sConfigInjected->InjectedChannel);

    /* Set the new sample time */
    hadc->Instance->SMPTIM1 |= ADC_SMPTIM1(sConfigInjected->InjectedSamplingTime, sConfigInjected->InjectedChannel);
  }
  else /* ADC_Channel include in ADC_Channel_[0..9] */
  {
    /* Clear the old sample time */
    hadc->Instance->SMPTIM2 &= ~ADC_SMPTIM2(ADC_SMPTIM2_SMPCYCCFG0, sConfigInjected->InjectedChannel);

    /* Set the new sample time */
    hadc->Instance->SMPTIM2 |= ADC_SMPTIM2(sConfigInjected->InjectedSamplingTime, sConfigInjected->InjectedChannel);
  }

#if defined(APM32F403xx) || defined(APM32F402xx)
  /* If ADC1 InjectedChannel_16 or InjectedChannel_17 is selected, enable Temperature sensor  */
  /* and VREFINT measurement path.                                            */
  if ((sConfigInjected->InjectedChannel == ADC_CHANNEL_TEMPSENSOR) ||
      (sConfigInjected->InjectedChannel == ADC_CHANNEL_VREFINT)      )
  {
    SET_BIT(hadc->Instance->CTRL2, ADC_CTRL2_TSVREFEN);
  }
#endif /* APM32F403xx || APM32F402xx */

  /*---------------------------- ADCx JSQR Configuration -----------------*/
  hadc->Instance->INJSEQ &= ~(ADC_INJSEQ_INJSEQLEN);
  hadc->Instance->INJSEQ |=  ADC_REGSEQ1(sConfigInjected->InjectedNbrOfConversion);

  /* Rank configuration */

  /* Clear the old SQx bits for the selected rank */
  hadc->Instance->INJSEQ &= ~ADC_INJSEQ(ADC_INJSEQ_INJSEQC1, sConfigInjected->InjectedRank,sConfigInjected->InjectedNbrOfConversion);

  /* Set the SQx bits for the selected rank */
  hadc->Instance->INJSEQ |= ADC_INJSEQ(sConfigInjected->InjectedChannel, sConfigInjected->InjectedRank,sConfigInjected->InjectedNbrOfConversion);

  /* Enable external trigger if trigger selection is different of software  */
  /* start.                                                                 */
  /* Note: This configuration keeps the hardware feature of parameter       */
  /*       ExternalTrigConvEdge "trigger edge none" equivalent to           */
  /*       software start.                                                  */
  if(sConfigInjected->ExternalTrigInjecConv != ADC_INJECTED_SOFTWARE_START)
  {
    /* Select external trigger to start conversion */
    hadc->Instance->CTRL2 &= ~(ADC_CTRL2_INJGEXTTRGSEL);
    hadc->Instance->CTRL2 |=  sConfigInjected->ExternalTrigInjecConv;

#if defined(APM32F403xx) || defined(APM32F402xx)
    /* Select external trigger polarity */
    hadc->Instance->CTRL2 |= ADC_CTRL2_INJEXTTRGEN;
#else
    /* Select external trigger polarity */
    hadc->Instance->CTRL2 &= ~(ADC_CTRL2_INJEXTTRGEN);
    hadc->Instance->CTRL2 |= sConfigInjected->ExternalTrigInjecConvEdge;
#endif /* APM32F403xx || APM32F402xx */
  }
  else
  {
    /* Reset the external trigger */
    hadc->Instance->CTRL2 &= ~(ADC_CTRL2_INJGEXTTRGSEL);
    hadc->Instance->CTRL2 &= ~(ADC_CTRL2_INJEXTTRGEN);
  }

  if (sConfigInjected->AutoInjectedConv != DISABLE)
  {
    /* Enable the selected ADC automatic injected group conversion */
    hadc->Instance->CTRL1 |= ADC_CTRL1_INJGACEN;
  }
  else
  {
    /* Disable the selected ADC automatic injected group conversion */
    hadc->Instance->CTRL1 &= ~(ADC_CTRL1_INJGACEN);
  }

  if (sConfigInjected->InjectedDiscontinuousConvMode != DISABLE)
  {
    /* Enable the selected ADC injected discontinuous mode */
    hadc->Instance->CTRL1 |= ADC_CTRL1_INJDISCEN;
  }
  else
  {
    /* Disable the selected ADC injected discontinuous mode */
    hadc->Instance->CTRL1 &= ~(ADC_CTRL1_INJDISCEN);
  }

  switch(sConfigInjected->InjectedRank)
  {
    case 1U:
      /* Set injected channel 1 offset */
      hadc->Instance->INJDOF1 &= ~(ADC_INJDOF1_INJDOF1);
      hadc->Instance->INJDOF1 |= sConfigInjected->InjectedOffset;
      break;
    case 2U:
      /* Set injected channel 2 offset */
      hadc->Instance->INJDOF2 &= ~(ADC_INJDOF2_INJDOF2);
      hadc->Instance->INJDOF2 |= sConfigInjected->InjectedOffset;
      break;
    case 3U:
      /* Set injected channel 3 offset */
      hadc->Instance->INJDOF3 &= ~(ADC_INJDOF3_INJDOF3);
      hadc->Instance->INJDOF3 |= sConfigInjected->InjectedOffset;
      break;
    default:
      /* Set injected channel 4 offset */
      hadc->Instance->INJDOF4 &= ~(ADC_INJDOF4_INJDOF4);
      hadc->Instance->INJDOF4 |= sConfigInjected->InjectedOffset;
      break;
  }

#if defined(APM32F403xx) || defined(APM32F402xx)
  /* If ADC1 Channel_16 or Channel_17 is selected, enable Temperature sensor  */
  /* and VREFINT measurement path.                                            */
  if ((sConfigInjected->InjectedChannel == ADC_CHANNEL_TEMPSENSOR) || (sConfigInjected->InjectedChannel == ADC_CHANNEL_VREFINT))
  {
    /* For APM32F402/403xx devices with several ADC: Only ADC1 can access internal    */
    /* measurement channels (VrefInt/TempSensor). If these channels are       */
    /* intended to be set on other ADC instances, an error is reported.       */
    if (hadc->Instance == ADC1)
    {
      if (READ_BIT(hadc->Instance->CTRL2, ADC_CTRL2_TSVREFEN) == RESET)
      {
        SET_BIT(hadc->Instance->CTRL2, ADC_CTRL2_TSVREFEN);

        if (sConfigInjected->InjectedChannel == ADC_CHANNEL_TEMPSENSOR)
        {
          /* Delay for temperature sensor stabilization time */
          /* Compute number of CPU cycles to wait for */
          counter = (ADC_TEMPSENSOR_DELAY_US * (SystemCoreClock / 1000000U));
          while(counter != 0U)
          {
            counter--;
          }
        }
      }
    }
    else
    {
      /* Update ADC state machine to error */
      SET_BIT(hadc->State, DAL_ADC_STATE_ERROR_CONFIG);
    }
  }
#else
  /* Pointer to the common control register to which is belonging hadc    */
  /* (Depending on APM32F4 product, there may be up to 3 ADC and 1 common */
  /* control register)                                                    */
    tmpADC_Common = ADC_COMMON_REGISTER(hadc);

  /* if ADC1 Channel_18 is selected enable VBAT Channel */
  if ((hadc->Instance == ADC1) && (sConfigInjected->InjectedChannel == ADC_CHANNEL_VBAT))
  {
    /* Enable the VBAT channel*/
    tmpADC_Common->CCTRL |= ADC_CCTRL_VBATEN;
  }

