betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_adc_ex.c
  /* if ADC1 Channel_16 or Channel_17 is selected enable TSVREFEN Channel(Temperature sensor and VREFINT) */
  if ((hadc->Instance == ADC1) && ((sConfigInjected->InjectedChannel == ADC_CHANNEL_TEMPSENSOR) || (sConfigInjected->InjectedChannel == ADC_CHANNEL_VREFINT)))
  {
    /* Enable the TSVREFEN channel*/
    tmpADC_Common->CCTRL |= ADC_CCTRL_TSVREFEN;
  }
#endif /* APM32F403xx || APM32F402xx */

  /* Process unlocked */
  __DAL_UNLOCK(hadc);

  /* Return function status */
  return DAL_OK;
}

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Configures the ADC multi-mode
  * @param  hadc       pointer to a ADC_HandleTypeDef structure that contains
  *                     the configuration information for the specified ADC.
  * @param  multimode  pointer to an ADC_MultiModeTypeDef structure that contains
  *                     the configuration information for  multimode.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ADCEx_MultiModeConfigChannel(ADC_HandleTypeDef* hadc, ADC_MultiModeTypeDef* multimode)
{

#if defined(APM32F403xx) || defined(APM32F402xx)
  ADC_HandleTypeDef tmphadcSlave={0};
#else
  ADC_Common_TypeDef *tmpADC_Common;
#endif /* APM32F403xx || APM32F402xx */

  /* Check the parameters */
  ASSERT_PARAM(IS_ADC_MODE(multimode->Mode));
#if defined(APM32F403xx) || defined(APM32F402xx)
  ASSERT_PARAM(IS_ADC_MULTIMODE_MASTER_INSTANCE(hadc->Instance));
#else
  ASSERT_PARAM(IS_ADC_DMA_ACCESS_MODE(multimode->DMAAccessMode));
  ASSERT_PARAM(IS_ADC_SAMPLING_DELAY(multimode->TwoSamplingDelay));
#endif /* APM32F403xx || APM32F402xx */

  /* Process locked */
  __DAL_LOCK(hadc);

#if defined(APM32F403xx) || defined(APM32F402xx)
  /* Set a temporary handle of the ADC slave associated to the ADC master     */
  ADC_MULTI_SLAVE(hadc, &tmphadcSlave);

  /* Parameters update conditioned to ADC state:                              */
  /* Parameters that can be updated when ADC is disabled or enabled without   */
  /* conversion on going on regular group:                                    */
  /*  - ADC master and ADC slave DMA configuration                            */
  /* Parameters that can be updated only when ADC is disabled:                */
  /*  - Multimode mode selection                                              */
  /* To optimize code, all multimode settings can be set when both ADCs of    */
  /* the common group are in state: disabled.                                 */
  if ((ADC_IS_ENABLE(hadc) == RESET)                     &&
      (ADC_IS_ENABLE(&tmphadcSlave) == RESET)            &&
      (IS_ADC_MULTIMODE_MASTER_INSTANCE(hadc->Instance))   )
  {
    MODIFY_REG(hadc->Instance->CTRL1,
               ADC_CTRL1_DUALMCFG   ,
               multimode->Mode     );
  }
  /* If one of the ADC sharing the same common group is enabled, no update    */
  /* could be done on neither of the multimode structure parameters.          */
  else
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, DAL_ADC_STATE_ERROR_CONFIG);

    /* Process unlocked */
    __DAL_UNLOCK(hadc);

    return DAL_ERROR;
  }

  /* Process unlocked */
  __DAL_UNLOCK(hadc);

#else
  /* Pointer to the common control register to which is belonging hadc    */
  /* (Depending on APM32F4 product, there may be up to 3 ADC and 1 common */
  /* control register)                                                    */
  tmpADC_Common = ADC_COMMON_REGISTER(hadc);

  /* Set ADC mode */
  tmpADC_Common->CCTRL &= ~(ADC_CCTRL_ADCMSEL);
  tmpADC_Common->CCTRL |= multimode->Mode;

  /* Set the ADC DMA access mode */
  tmpADC_Common->CCTRL &= ~(ADC_CCTRL_DMAMODE);
  tmpADC_Common->CCTRL |= multimode->DMAAccessMode;

  /* Set delay between two sampling phases */
  tmpADC_Common->CCTRL &= ~(ADC_CCTRL_SMPDEL2);
  tmpADC_Common->CCTRL |= multimode->TwoSamplingDelay;

  /* Process unlocked */
  __DAL_UNLOCK(hadc);
#endif /* APM32F403xx || APM32F402xx */

  /* Return function status */
  return DAL_OK;
}
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  DMA transfer complete callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *                the configuration information for the specified DMA module.
  * @retval None
  */
static void ADC_MultiModeDMAConvCplt(DMA_HandleTypeDef *hdma)
{
  /* Retrieve ADC handle corresponding to current DMA handle */
  ADC_HandleTypeDef* hadc = ( ADC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

  /* Update state machine on conversion status if not in error state */
  if (DAL_IS_BIT_CLR(hadc->State, DAL_ADC_STATE_ERROR_INTERNAL | DAL_ADC_STATE_ERROR_DMA))
  {
    /* Update ADC state machine */
    SET_BIT(hadc->State, DAL_ADC_STATE_REG_EOC);

    /* Determine whether any further conversion upcoming on group regular   */
    /* by external trigger, continuous mode or scan sequence on going.      */
    /* Note: On APM32F4, there is no independent flag of end of sequence.   */
    /*       The test of scan sequence on going is done either with scan    */
    /*       sequence disabled or with end of conversion flag set to        */
    /*       of end of sequence.                                            */
#if defined(APM32F403xx) || defined(APM32F402xx)
    if(ADC_IS_SOFTWARE_START_REGULAR(hadc)                   &&
       (hadc->Init.ContinuousConvMode == DISABLE))
#else
    if(ADC_IS_SOFTWARE_START_REGULAR(hadc)                   &&
       (hadc->Init.ContinuousConvMode == DISABLE)            &&
       (DAL_IS_BIT_CLR(hadc->Instance->REGSEQ1, ADC_REGSEQ1_REGSEQLEN) ||
        DAL_IS_BIT_CLR(hadc->Instance->CTRL2, ADC_CTRL2_EOCSEL)  )   )
#endif /* APM32F403xx || APM32F402xx */
    {
      /* Disable ADC end of single conversion interrupt on group regular */
      /* Note: Overrun interrupt was enabled with EOC interrupt in          */
      /* DAL_ADC_Start_IT(), but is not disabled here because can be used   */
      /* by overrun IRQ process below.                                      */
      __DAL_ADC_DISABLE_IT(hadc, ADC_IT_EOC);

